InformationRegisters/ИнтеграцияКэшЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИнтеграцияКэшЗначений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Comment>Если текущая дата больше даты актуальности, то кэш недействителен</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>555</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ИнтеграцияКэшСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс
Процедура КэшЗаписать( Ключ, Значение, ДатаАктуальности = Неопределено ) Экспорт
	
	МаксимальнаяДлинаКлюча = ИнтеграцияКэшКлиентСервер.МаксимальнаяДлинаКлючаПолучить();

	КлючДлина = СтрДлина( Ключ );
	Если КлючДлина > МаксимальнаяДлинаКлюча Тогда
		ВызватьИсключение "ИнтеграцияКэшСервер.КэшЗаписать: Ошибка: Длина ключа больше максимальной, "
		 + КлючДлина + " > " + МаксимальнаяДлинаКлюча + ": " + Ключ;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено( ДатаАктуальности ) Тогда
		ДатаАктуальности = ДатаАктуальностиКэшаПоУмолчанию();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим( Истина );
	
	РегистрыСведенийИнтеграцияКэшЗначенийЗапись = РегистрыСведений.ИнтеграцияКэшЗначений.СоздатьМенеджерЗаписи();
	
	РегистрыСведенийИнтеграцияКэшЗначенийЗапись.Ключ = Ключ;
	РегистрыСведенийИнтеграцияКэшЗначенийЗапись.Значение = Новый ХранилищеЗначения( Значение, Новый СжатиеДанных( 9 ) );
	РегистрыСведенийИнтеграцияКэшЗначенийЗапись.ДатаОбновления = ТекущаяДатаСеанса();
	РегистрыСведенийИнтеграцияКэшЗначенийЗапись.ДатаАктуальности = ДатаАктуальности;
	
	РегистрыСведенийИнтеграцияКэшЗначенийЗапись.Записать( Истина );
	
	УстановитьПривилегированныйРежим( Ложь );
	
КонецПроцедуры

Функция КэшПолучить( Ключ ) Экспорт
	
	МаксимальнаяДлинаКлюча = ИнтеграцияКэшКлиентСервер.МаксимальнаяДлинаКлючаПолучить();

	КлючДлина = СтрДлина( Ключ );
	Если КлючДлина > МаксимальнаяДлинаКлюча Тогда
		ВызватьИсключение "ИнтеграцияКэшСервер.КэшПолучить: Ошибка: Длина ключа больше максимальной, "
		 + КлючДлина + " > " + МаксимальнаяДлинаКлюча + ": " + Ключ;
	КонецЕсли;
	
	Результат = Неопределено;
	
	УстановитьПривилегированныйРежим( Истина );
	ЗапросТекст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИнтеграцияКэшЗначений.Значение КАК Значение,
	|	ИнтеграцияКэшЗначений.ДатаОбновления КАК ДатаОбновления
	|ИЗ
	|	РегистрСведений.ИнтеграцияКэшЗначений КАК ИнтеграцияКэшЗначений
	|ГДЕ
	|	ИнтеграцияКэшЗначений.Ключ = &Ключ
	|	И ИнтеграцияКэшЗначений.ДатаАктуальности >= &ДатаАктуальностиКэша";
	
	ЗапросОбъект = Новый Запрос( ЗапросТекст );
	
	ЗапросОбъект.УстановитьПараметр( "Ключ", Ключ );
	
	ДатаАктуальностиКэша = ТекущаяДатаСеанса();
	ЗапросОбъект.УстановитьПараметр( "ДатаАктуальностиКэша", ДатаАктуальностиКэша );
	
	ЗапросВыборка = ЗапросОбъект.Выполнить().Выбрать();
	Если ЗапросВыборка.Следующий() = Истина Тогда
		Результат = ЗапросВыборка.Значение.Получить();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим( Ложь );
	
	Возврат Результат;
КонецФункции

Функция ДатаАктуальностиКэшаПоУмолчанию() Экспорт
	Возврат ДобавитьМесяц( ТекущаяДатаСеанса(), 1 );
КонецФункции

Процедура КэшУдалитьНеактуальныеЗначения() Экспорт

	УстановитьПривилегированныйРежим( Истина );

	ЗапросТекст = 
	"ВЫБРАТЬ
	|	ИнтеграцияКэшЗначений.Ключ КАК Ключ
	|ИЗ
	|	РегистрСведений.ИнтеграцияКэшЗначений КАК ИнтеграцияКэшЗначений
	|ГДЕ
	|	ИнтеграцияКэшЗначений.ДатаАктуальности < &ДатаАктуальностиКэша";
	
	ЗапросОбъект = Новый Запрос( ЗапросТекст );
	
	ДатаАктуальностиКэша = ТекущаяДатаСеанса();
	ЗапросОбъект.УстановитьПараметр( "ДатаАктуальностиКэша", ДатаАктуальностиКэша );
	
	ЗапросРезультат = ЗапросОбъект.Выполнить();
	Если ЗапросРезультат.Пустой() Тогда
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();
	Попытка
	
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить( "РегистрСведений.ИнтеграцияКэшЗначений" );
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировкиДанных.ИсточникДанных = ЗапросРезультат;
		ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных( "Ключ", "Ключ" );
		БлокировкаДанных.Заблокировать();
		
		ЗапросВыборка = ЗапросРезультат.Выбрать();
		НаборЗаписей = РегистрыСведений.ИнтеграцияКэшЗначений.СоздатьНаборЗаписей();
		Пока ЗапросВыборка.Следующий() Цикл
			НаборЗаписей.Отбор.Ключ.Установить( ЗапросВыборка.Ключ, Истина );
			НаборЗаписей.Записать( Истина );
		КонецЦикла;

		ЗафиксироватьТранзакцию();
		
	Исключение
	
		ОтменитьТранзакцию();

		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЛогКомментарий = "КэшУдалитьНеактуальныеЗначения: Ошибка: " + ПодробноеПредставлениеОшибки;
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ЛогКомментарий, , Истина );
	КонецПопытки;
	УстановитьПривилегированныйРежим( Ложь );
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
